# Exploration des données

In [1]:
import pandas as pd
dataFrame=pd.read_csv("job-data.csv", encoding='latin-1')

In [2]:
dataFrame.head(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."
5,ServiceNow,Sr Staff Data Scientist - ATG,"Kirkland, Washington, United States",Full Time,Senior-level,184K+,"Computer Science,Deep Learning,Industrial,Mach...","401(k) matching,Career development,Competitive..."
6,Natixis in Portugal,Vendor Management and Data Quality Lead,"Porto, Portugal",Full Time,Entry-level,39K+ *,"Banking,Data quality,Excel,Security,,","Gear,,,,"
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,NaN,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex..."
9,Palo Alto Networks,Principal Cloud Data Engineer (Prisma Access),"Santa Clara, CA, United States",Full Time,Senior-level,140K+,"Agile,APIs,AWS,Azure,Big Data,Computer Science","Career development,Medical leave,Salary bonus,..."

In [3]:
dataFrame.sample(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
2908,Foundry,"Senior Research Engineer, Machine Learning","London, England, United Kingdom",Full Time,Senior-level,105K+ *,"Agile,Computer Science,Computer Vision,Enginee...","Career development,Flex hours,Flex vacation,He..."
2368,Block,"Decision Scientist, Risk","San Francisco, CA, United States",Full Time,Senior-level,129K+,"AWS,Banking,Big Data,Blockchain,Computer Scien...","Career development,Equity,Health care,Insuranc..."
277,dentsu international,Data Scientist,"Remote, CA, United States",Full Time,Executive-level,78K+,"Causal inference,Data Analytics,E-commerce,Eco...","Career development,Health care,Startup environ..."
411,Future PLC,Senior Business Intelligence Analyst,"Bath, England, United Kingdom",Full Time,Senior-level,NaN,"Agile,BigQuery,Business Intelligence,Data anal...","Team events,Unlimited paid time off,,,"
898,Hopper,Senior Machine Learning Engineer- Price Freeze...,Toronto,Full Time,Senior-level,131K+ *,"Amplitude,BigQuery,Data visualization,Docker,F...","Career development,Competitive pay,Equity,Heal..."
840,NielsenIQ,Data Analyst,"Lisbon, Portugal",Full Time,Senior-level,92K+ *,"Business Intelligence,Data visualization,Econo...",",,,,"
2909,Locus Robotics,"Staff Engineer, Robotics Controls (Research &...","Nashua, NH, United States",Full Time,Senior-level,69K+ *,"Architecture,Computer Science,E-commerce,Engin...","Career development,,,,"
2747,Bosch Group,Software Engineer for Real-Driving Data Analys...,"Budapest, Hungary",Full Time,NaN,56K+ *,"APIs,AWS,Azure,Data analysis,Engineering,Hadoop","Career development,Flex hours,Health care,,"
2864,Palo Alto Networks,Senior Engineer Software (ML Applications NLP),"Santa Clara, CA, United States",Full Time,Senior-level,119K+,"Computer Science,Deep Learning,Engineering,Mac...","Career development,Health care,Medical leave,S..."
597,Definitive Logic,Business Intelligence (Qlik) Developer,"Arlington, VA",Full Time,Mid-level,56K+ *,"Agile,Business Intelligence,Consulting,Consult...","Career development,Competitive pay,Flex hours,..."

On essai de afficher les premier lignes de notre data set pour just savoir sa forme.

<ul>
<li>Les valeurs NAN </li>
<p> est ce que on peut remplaire ces valeur ? ou bien il faut les supprimer</p>
<li>list des <strong>facilities</strong></li>
<p>une list des que on peut la separer</p>
<li>forme de <strong>salary</strong> "48K+*" </li>
<p>des salaire avec des etoile ,cest quoi la senification de ces etoiles ?, on remarque que on a des salaire sans "*"</p>
<p>On remarque que les salaire sont on deferente davise il faut les unifier.(eur,£,$)</p>

<li>les  <strong>job title</strong> on deferente language il faut les unifier on oenlais ou bien en français </li>

<li>les  <strong>location</strong> on va les deviser par city,state county</li>


</ul>

In [4]:
print("list of unique Salary :",dataFrame["Salary"].unique().tolist())

list of unique Salary : [' 48K+ *', ' 90K+ *', ' 108K+', ' 184K+', ' 39K+ *', nan, ' 140K+', ' 40K+ *', ' 80K+ *', ' 35K+ *', ' 62K+ *', ' 159K+', ' 97K+', ' 92K+ *', ' 129K+ *', ' 115K+ *', ' 44K+ *', ' 73K+ *', ' 59K+ *', ' 106K+', ' 105K+ *', ' 55K+ *', ' 110K+ *', ' 63K+ *', ' 49K+ *', ' 180K+', ' 127K+', ' 60K+', ' 45K+ *', ' 135K+', ' 69K+ *', ' 176K+', ' 65K+ *', ' 51K+ *', ' 67K+', ' 104K+', ' 105K+', ' 166K+', ' 131K+ *', ' 115K+', ' 43K+', ' 81K+ *', ' 96K+ *', ' 56K+ *', ' 130K+', ' 131K+', ' 50K+ *', ' 100K+', ' 60K+ *', ' 52K+', ' 135K+ *', ' 76K+', ' 172K+', ' 119K+', ' 125K+', ' 116K+', ' 77K+ *', ' 74K+ *', ' 70K+ *', ' 120K+', ' 189K+', ' 149K+', ' 110K+', ' 90K+', ' 30K+ *', ' 167K+', ' 236K+', ' 179K+', ' 80K+', ' 200K+', ' 139K+', ' 129K+', ' 113K+', ' 150K+', ' 158K+', ' 40K+', ' 184K+ *', ' 133K+', ' 78K+', ' 36K+ *', ' 122K+ *', ' 81K+', ' 59K+', 'EUR 81K', ' 190K+', ' 72K+', ' 136K+', ' 102K+ *', ' 31K+ *', ' 89K+ *', ' 156K+', ' 107K+', ' 199K+', ' 224K+', ' 142K+', 'GBP 35K', ' 183K+', ' 164K+', 'EUR 130K+', ' 174K+', ' 84K+', ' 79K+', ' 103K+ *', ' 143K+', ' 175K+', ' 170K+', ' 141K+ *', ' 283K+', ' 151K+', ' 111K+', ' 51K+', ' 96K+', ' 148K+', ' 204K+', ' 202K+', ' 295K+', ' 68K+', ' 195K+', ' 145K+', ' 50K+', ' 267K+', ' 200K+ *', ' 109K+ *', ' 310K+', ' 153K+', ' 154K+', ' 86K+', ' 70K+', ' 207K+', ' 85K+', ' 66K+', ' 315K+', ' 160K+', ' 66K+ *', ' 144K+', ' 245K+', ' 126K+', ' 63K+', ' 182K+', ' 157K+', ' 214K+', ' 173K+', 'EUR 80K+', ' 120K+ *', 'EUR 36K+', 'EUR 60K+', 'GBP 42K+', ' 112K+', ' 124K+', ' 185K+', ' 147K+', ' 122K+', 'GBP 80K+', ' 144K+ *', ' 146K+', ' 165K+', ' 75K+', ' 163K+', ' 193K+', ' 109K+', 'GBP 60K+', ' 218K+', ' 230K+', ' 168K+', ' 134K+', ' 225K+', ' 253K+', ' 83K+', ' 235K+', ' 187K+', ' 227K+', ' 73K+', ' 61K+ *', ' 171K+', ' 234K+', 'GBP 45K+', ' 155K+', ' 71K+', ' 94K+', ' 57K+ *', ' 197K+', ' 102K+', ' 82K+', ' 177K+', 'GBP 50K+', ' 93K+', ' 55K+', ' 121K+', ' 42K+ *', ' 45K+', ' 75K+ *', ' 152K+', ' 161K+', ' 155K+ *', ' 132K+', 'GBP 55K+', ' 138K+', ' 196K+', ' 205K+', 'GBP 65K+', ' 178K+', ' 95K+', ' 33K+ *', ' 54K+ *', ' 98K+', ' 141K+', ' 95K+ *', ' 65K+', 'GBP 55K', ' 99K+', ' 220K+', ' 74K+', ' 103K+', ' 100K+ *', 'GBP 51K+', ' 128K+', 'GBP 54K+', ' 123K+', ' 117K+']

In [5]:
dataFrame.Salary.sort_values(ascending=False)

1246    GBP 80K+
2536    GBP 65K+
1384    GBP 60K+
2492    GBP 55K+
2716     GBP 55K
          ...
3126         NaN
3134         NaN
3152         NaN
3159         NaN
3166         NaN
Name: Salary, Length: 3198, dtype: object

In [6]:
print("number of rows :",dataFrame.shape[0])

number of rows : 3198

In [7]:
print("number of columns :",str(dataFrame.shape[1])+" : "+ str(dataFrame.columns))

number of columns : 8 : Index(['Company', 'Job Title', 'Location', 'Job Type', 'Experience level',
       'Salary', 'Requirment of the company ', 'Facilities'],
      dtype='object')

In [8]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3198 entries, 0 to 3197
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     3197 non-null   object
 1   Job Title                   3197 non-null   object
 2   Location                    3197 non-null   object
 3   Job Type                    3197 non-null   object
 4   Experience level            2962 non-null   object
 5   Salary                      3009 non-null   object
 6   Requirment of the company   3198 non-null   object
 7   Facilities                  3198 non-null   object
dtypes: object(8)
memory usage: 200.0+ KB

In [9]:
dataFrame.describe()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
count,3197,3197,3197,3197,2962,3009,3198,3198
unique,1106,2138,1117,3,4,218,2600,777
top,Publicis Groupe,Data Engineer,"Bengaluru, India",Full Time,Senior-level,115K+ *,"Big Data,Business Intelligence,Data analysis,E...",",,,,"
freq,126,105,90,3116,1876,253,12,542

In [10]:
print("list of unique Job types :",dataFrame["Job Type"].unique())

list of unique Job types : ['Full Time' 'Internship' 'Part Time' nan]

In [11]:
print("list of unique Job Title :",dataFrame["Job Title"].unique())

list of unique Job Title : ['Clinical Data Analyst' 'AML/CFT & Data Analyst'
 'Machine Learning Engineer' ...
 'Application Integration Engineer, Computer Vision Program'
 'Senior Software Engineer, Machine Learning - Ads Intelligence'
 'Data Scientist - New College Graduate']

In [12]:
print("list of unique Experience level	 :",dataFrame["Experience level"].unique())

list of unique Experience level	 : ['Entry-level' nan 'Mid-level' 'Senior-level' 'Executive-level']

#### Duplicates

In [13]:
dataFrame.duplicated().sum()

202

In [14]:
dataFrame.drop_duplicates(inplace=True)

In [15]:
dataFrame.isna().sum()

Company                         1
Job Title                       1
Location                        1
Job Type                        1
Experience level              228
Salary                        172
Requirment of the company       0
Facilities                      0
dtype: int64

# Data Cleaning

### Salary column

In [16]:
dataFrame["Salary"].isna().sum()

172

In [17]:
dataFrame["Salary"].str.strip()

0       48K+ *
1       48K+ *
2       90K+ *
3       48K+ *
4        108K+
         ...
3190     113K+
3191     106K+
3192     176K+
3193    39K+ *
3196    39K+ *
Name: Salary, Length: 2996, dtype: object

In [19]:
dataFrame[dataFrame["Salary"].isna()].sort_values('Location')

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
669,bunq,Data Science Intern - Large Language Models,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,"
973,bunq,Data Science Intern - Large Language Model,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,"
3073,Definitive Logic,Data Science Intern,"Arlington, VA",Internship,Entry-level,NaN,"Big Data,Consulting,Consulting firm,Data analy...","Career development,Competitive pay,Flex hours,..."
1525,Cube RM,Business Data Analyst Intern,"Athens, Attica, Greece",Internship,Entry-level,NaN,"Agile,Azure,Computer Science,Data analysis,Exc...","Career development,Flex hours,Flex vacation,Ge..."
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
...,...,...,...,...,...,...,...,...
1669,Dentons,Marketing Data Analyst Intern,"Warsaw, Masovian Voivodeship, Poland",Internship,Entry-level,NaN,"Data analysis,Excel,,,,",",,,,"
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,NaN,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He..."
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,NaN,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,"
1954,Opera,Data Scientist Summer Intern,"Wroclaw, PL",Part Time,Entry-level,NaN,"Computer Science,Data analysis,Data visualizat...","Startup environment,,,,"
797,NaN,NaN,NaN,NaN,NaN,NaN,",,,,,",",,,,"

In [20]:
dataFrame.dropna(thresh=3,inplace=True)

In [21]:
dataFrame[dataFrame["Job Title"]=='Data Science Intern']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
522,ChargePoint,Data Science Intern,"Campbell, CA",Internship,Entry-level,NaN,"AWS,Big Data,Business Intelligence,Data analys...","Career development,Equity,Gear,,"
869,GOURMEY,Data Science Intern,"Paris, Île-de-France, France",Internship,Entry-level,NaN,"Agile,Data Analytics,Data management,Engineeri...","Health care,Startup environment,,,"
1641,Utility Warehouse,Data Science Intern,"London, United Kingdom",Full Time,Entry-level,NaN,"A/B testing,Causal inference,Computer Science,...","Career development,Flex hours,Insurance,Startu..."
1849,Prove,Data Science Intern,Denver,Internship,Entry-level,NaN,"Banking,Computer Science,Crypto,E-commerce,Eng...",",,,,"
2206,Utility Warehouse,Data Science Intern,"London, United Kingdom",Full Time,Entry-level,NaN,"A/B testing,Causal inference,Computer Science,...","Career development,Competitive pay,Equity,Fitn..."
3073,Definitive Logic,Data Science Intern,"Arlington, VA",Internship,Entry-level,NaN,"Big Data,Consulting,Consulting firm,Data analy...","Career development,Competitive pay,Flex hours,..."

In [22]:
# pour les valeurs nan on salaire on va les remplacer par "negossiable" pour le moment 
dataFrame["Salary"].fillna("negociable",inplace=True)

In [23]:
dataFrame[dataFrame["Location"]=="Paris, France"]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
117,Talan,Talan Consulting  Consultant Senior/Manager ...,"Paris, France",Full Time,Senior-level,62K+ *,"Architecture,Consulting,Data governance,Data m...",",,,,"
142,Alter Solutions,Développeur Power BI - H/F,"Paris, France",Full Time,Senior-level,62K+ *,"Agile,Architecture,KPIs,Power BI,Privacy,R",",,,,"
420,Sewan,Product Data Analyst sénior (h/f) en CDI à Paris,"Paris, France",Full Time,NaN,80K+ *,"Amplitude,Python,R,SQL,,",",,,,"
471,CleverConnect,Data Analyst - Stage de fin d'études - Paris 2e,"Paris, France",Full Time,Entry-level,48K+ *,"Agile,Architecture,AWS,BigQuery,Dataflow,Data ...","Career development,Yoga,,,"
474,Adevinta,Product Data Analyst - F/H,"Paris, France",Full Time,Senior-level,92K+ *,"E-commerce,Python,SQL,,,","Flex hours,Team events,,,"
...,...,...,...,...,...,...,...,...
2906,TripAdvisor,Senior Data Engineer,"Paris, France",Full Time,Senior-level,115K+ *,"Agile,Airflow,Architecture,AWS,BigQuery,CI/CD","Career development,Competitive pay,Equity,Flex..."
2968,Talan,Consultant DataOps/DevOps,"Paris, France",Full Time,Entry-level,39K+ *,"Agile,Ansible,AWS,Azure,Big Data,Blockchain",",,,,"
2996,Talan,Consultant Data Visualisation - H/F,"Paris, France",Full Time,NaN,56K+ *,"Agile,Architecture,Big Data,Blockchain,Busines...",",,,,"
3034,Sewan,Product Data Analyst sénior (h/f) en CDI à Paris,"Paris, France",Full Time,Senior-level,92K+ *,"Amplitude,Python,R,SQL,,",",,,,"
3159,Deezer,Data Analyst Intern m/f/d - Business,"Paris, France",Internship,Entry-level,negociable,"Data analysis,Data pipelines,Data visualizatio...","Career development,Health care,Insurance,Start..."

In [24]:
dataFrame[['Salary', 'Plus']] = dataFrame["Salary"].apply(lambda x: pd.Series(str(x).split("+")))

In [28]:
dataFrame.rename(columns={'Plus':'Bonuses'},inplace=True)

Bonuses est une colonnes qui sinifier les primes (*).

In [30]:
dataFrame[dataFrame["Bonuses"]=='']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Bonuses
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi...",
5,ServiceNow,Sr Staff Data Scientist - ATG,"Kirkland, Washington, United States",Full Time,Senior-level,184K,"Computer Science,Deep Learning,Industrial,Mach...","401(k) matching,Career development,Competitive...",
9,Palo Alto Networks,Principal Cloud Data Engineer (Prisma Access),"Santa Clara, CA, United States",Full Time,Senior-level,140K,"Agile,APIs,AWS,Azure,Big Data,Computer Science","Career development,Medical leave,Salary bonus,...",
15,ServiceNow,Staff Data Scientist - ATG,"Kirkland, Washington, United States",Full Time,Senior-level,159K,"Computer Science,Deep Learning,Industrial,Mach...","401(k) matching,Career development,Competitive...",
16,PlayStation Global,Machine Learning Engineer,"United States, Aliso Viejo, CA",Full Time,Senior-level,97K,"AWS,CUDA,Docker,Git,GitHub,GitLab","Career development,Competitive pay,Health care...",
...,...,...,...,...,...,...,...,...,...
3186,ServiceNow,Sr Software QA Engineer-Machine Learning QE,"Santa Clara, California, United States",Full Time,Senior-level,117K,"Engineering,Git,JavaScript,Machine Learning,Ma...","401(k) matching,Competitive pay,Equity,Flex ho...",
3188,TripAdvisor,Senior Machine Learning Engineer (Trip Planning),"Needham, Massachusetts, MA",Full Time,Senior-level,170K,"Big Data,Computer Science,Computer Vision,Engi...","Career development,Conferences,Flex hours,Flex...",
3190,CCRi,"Application Integration Engineer, Computer Vis...","Chantilly, Virginia, United States",Full Time,Mid-level,113K,"Agile,Angular,APIs,Architecture,AWS,Azure","401(k) matching,Career development,Flex hours,...",
3191,Publicis Groupe,"Associate Director, Data Science","New York City, United States",Full Time,Mid-level,106K,"Bayesian,Classification,Clustering,Data analys...","Career development,Health care,,,",
3192,DoorDash,"Senior Software Engineer, Machine Learning - A...","Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior-level,176K,"Computer Science,Data analysis,Engineering,Exc...","401(k) matching,Career development,Equity,Insu...",